{
  "date": "February 21, 2026",
  "release": "R26.051-0221",
  "dateRange": "February 14, 2026 to February 21, 2026",
  "newFeatures": [
    {
      "title": "Implement Budgeting for mission campaign",
      "platform": "All",
      "plan": "Shopify & Salla: Free / Pro / GURU · Selfserve: Starter / Growth / Enterprise",
      "channel": "All",
      "description": "<div>Enabling budget from dashboard for nonsequential mission campaign and allow for addding reward cost for each reward </div>",
      "capabilities": []
    },
    {
      "title": "Improve Quiz Ranking Logic to Reduce Score Ties and Ensure Fair Winner Selection",
      "platform": "All",
      "plan": "Shopify & Salla: Free / Pro / GURU · Selfserve: Starter / Growth / Enterprise",
      "channel": "All",
      "description": "<div><p><strong>As a</strong> client running quizzes and competitions<br><strong>I want</strong> a fair and transparent ranking system that minimizes tied scores<br><strong>So that</strong> I can clearly identify top winners and reward customers accurately. </p><h3>Problem Statement </h3><p>Currently, each correct quiz answer awards <strong>10 points plus a timer-based bonus</strong>.<br>\nIn cases where clients configure the timer to exceed 10 seconds, the <strong>timer bonus can exceed the base question score</strong>, leading to: </p><ul><li><p>Disproportionately high bonus points </p> </li><li><p>Many customers ending with <strong>identical total scores</strong> </p> </li><li><p>Scenarios where <strong>20–100 users are tied</strong>, making it difficult to select a clear top 5 or top 10 winners </p> </li> </ul><div><h3>Proposed Improvements </h3><p>To ensure fairer ranking and clearer winner selection, the quiz ranking logic will be enhanced through the following changes: </p><ol><li><p><strong>Additional Ranking Layers (Tie-Breakers)</strong> </p><ul><li><p>Total number of correct answers across all quiz days </p> </li><li><p>Total time taken to complete all quiz questions across all days </p> </li> </ul> </li><li><p><strong>Score Balance Adjustment</strong> </p><ul><li><p>Each correct question will award a fixed <strong>100 points</strong> </p> </li><li><p>Timer bonus will always be lower than the question score </p> </li><li><p>Accuracy is prioritized over speed, while speed still matters </p> </li> </ul> </li><li><p><strong>Timer Cap</strong> </p><ul><li><p>Maximum timer value capped at <strong>99 seconds</strong> </p> </li><li><p>Prevents excessively high bonus scores due to long timers </p> </li> </ul> </li><li><p><strong>Transparency</strong> </p><ul><li><p>A hint or tooltip will be added to the leaderboard </p> </li><li><p>Explains how customers are ranked when scores are tied </p> </li> </ul> </li> </ol><p>These changes aim to significantly reduce score ties and improve fairness across all clients. </p><br> </div><br> </div>",
      "capabilities": [
        {
          "title": "Key Capabilities",
          "items": [
            "<div><h2>Acceptance Criteria </h2><h3>Scoring Logic </h3><ul><li><p>Each correct answer awards a fixed <strong>100 base points</strong>. </p> </li><li><p>Timer bonus is calculated separately and is always less than the base question score. </p> </li><li><p>Timer values greater than 99 seconds are capped at 99 seconds for bonus calculation. </p> </li> </ul><h3>Ranking &amp; Tie-Breakers </h3><ul><li><p>Customers are primarily ranked by <strong>total score</strong>. </p> </li><li><p>In the case of tied scores, ranking is resolved using the following tie-breakers in order: </p><ol><li><p>Total number of correct answers across all quiz days </p> </li><li><p>Total time taken to complete all quiz questions across all days </p> </li> </ol> </li><li><p>If all ranking layers are identical, customers retain the same rank. </p> </li> </ul><h3>Data Accuracy </h3><ul><li><p>Correct answer count and total time are accurately aggregated across all quiz days. </p> </li><li><p>Ranking calculations are consistent across leaderboard views and exports. </p> </li> </ul><h3>Leaderboard Transparency </h3><ul><li><p>The leaderboard includes a <strong>hint or tooltip</strong> explaining: </p><ul><li><p>How scores are calculated </p> </li><li><p>How ties are resolved </p> </li> </ul> </li><li><p>The explanation is written in clear, customer-friendly language. </p> </li> </ul><h3>Backward Compatibility </h3><ul><li><p>Existing quizzes continue to function without data loss. </p> </li><li><p>Ranking logic updates apply to new and ongoing quizzes where applicable. </p> </li><li><p>No breaking changes are introduced to leaderboard APIs. </p> </li> </ul><h3>Performance </h3><ul><li><p>Ranking recalculation does not introduce noticeable delays. </p> </li><li><p>Leaderboard updates remain performant for large participant counts. </p> </li> </ul><br> </div>"
          ]
        }
      ]
    },
    {
      "title": "Custom Earn Options for Line Items (Phase II)",
      "platform": "All",
      "plan": "Shopify & Salla: Free / Pro / GURU · Selfserve: Starter / Growth / Enterprise",
      "channel": "All",
      "description": "<h2>User Story </h2><p><strong>As a</strong> Client<br><strong>I want</strong> Configure custom earning rules for line items based on various attributes<br><strong>So that</strong> Increased flexibility and control over earning points for clients </p><hr><h2>Description </h2><p>Currently, clients can only include or exclude order/line items from earning points through the system, but they lack the ability to create custom earning rules based on specific attributes such as collections, merchants, payment methods, and other attributes. </p><p>Introduce custom earn options for line items, allowing clients to create specific earning rules for different attributes, such as collections, merchants, payment methods, and any other attribute they have inside the order. This will enable clients to have more control over how points are earned and to create more targeted and effective earning strategies. </p><p>The earn section, line items, order attributes, and extra attributes for line items will be impacted by this change. The system will need to be updated to accommodate the new custom earning rules and to process the new attribute data correctly. </p><hr><h2>Plans </h2><ul><li>Shopify: GURU </li><li>Salla: GURU </li><li>Enterprise: Custom </li> </ul>",
      "capabilities": [
        {
          "title": "Key Capabilities",
          "items": [
            "<h3>Functional Requirements </h3><ul><li>Allow clients to create custom earning rules for line items based on various attributes such as collections, merchants, payment methods, and other attributes </li><li>Enable clients to set specific earning rates for different attributes, such as earning 2 points for every 1 EGP paid for a specific collection </li><li>Provide an option for clients to exclude certain attributes or line items from earning points </li><li>Allow clients to use extra attributes for line items to create custom earning rules </li><li>Validate that the custom earning rules are correctly applied to line items and orders </li><li>Ensure that the system can handle a large number of custom earning rules without impacting performance </li> </ul><h3>Behavior &amp; Logic </h3><ul><li>The system should evaluate the custom earning rules for each line item and apply the corresponding earning rate </li><li>If multiple custom earning rules apply to a single line item, the system should use the most specific rule </li><li>If a client sets a custom earning rule for a specific attribute, the system should override the default earning rate for that attribute </li><li>The system should handle cases where a client sets conflicting custom earning rules, such as earning 2 points for a specific collection and excluding that collection from earning points </li><li>The system should provide an interface for clients to manage and edit their custom earning rules </li><li>The system should validate that the custom earning rules are correctly formatted and do not contain any errors </li> </ul><h3>Validation &amp; Error Handling </h3><ul><li>Validate that the custom earning rules are correctly formatted and contain all required information </li><li>Check that the custom earning rules do not contain any conflicts or errors </li><li>Handle cases where a client attempts to create a custom earning rule with invalid or missing information </li><li>Provide clear and concise error messages to clients when errors occur </li> </ul><h3>Data Accuracy &amp; Consistency </h3><ul><li>Ensure that the custom earning rules are accurately stored and retrieved from the database </li><li>Validate that the custom earning rules are correctly applied to line items and orders </li><li>Check that the earning rates calculated using the custom earning rules are accurate and consistent </li><li>Prevent data corruption or loss when updating or deleting custom earning rules </li><li>Ensure that the system can handle a large volume of custom earning rules without impacting data accuracy </li><li>Provide a mechanism for auditing and verifying the accuracy of the custom earning rules </li> </ul><ul> </ul><h3>Backward Compatibility </h3><ul><li>Ensure that the new custom earning rules feature does not break existing functionality or earning rules </li><li>Provide a mechanism for clients to migrate their existing earning rules to the new custom earning rules format </li><li>Handle cases where a client has existing earning rules that are incompatible with the new custom earning rules feature </li><li>Provide clear and concise documentation for clients on how to use the new custom earning rules feature </li> </ul><h3>Performance &amp; Scalability </h3><ul><li>Ensure that the system can handle 10 custom earning rules without impacting performance </li> </ul>"
          ]
        }
      ]
    }
  ],
  "improvements": [
    {
      "title": "Track Customer Inclusion/Exclusion Actions in Team Activities Audit Trail",
      "overview": "<div><strong>As a</strong>&nbsp;dashboard user<br><strong>I want</strong> customer inclusion and exclusion actions to appear in the team activities audit trail<br><strong>So that</strong> I can see who included or excluded customers from the program and maintain accountability.<br> </div><div><br> </div><div><p>Currently, when a dashboard member includes or excludes customers from a program, this action is not recorded in the <strong>team activities audit trail</strong>. </p><p>This enhancement will ensure that <strong>all customer inclusion and exclusion actions</strong> performed by dashboard members are: </p><ul><li><p>Logged in the audit trail </p> </li><li><p>Attributed to the user who performed the action </p> </li><li><p>Visible to authorized team members for transparency and governance </p> </li> </ul> </div>",
      "whatsNew": [
        {
          "title": "What's New",
          "description": "",
          "items": [
            "<div><h2>Acceptance Criteria </h2><h3>Audit Trail Coverage </h3><ul><li><p>Customer <strong>inclusion</strong> actions are logged in the team activities audit trail. </p> </li><li><p>Customer <strong>exclusion</strong> actions are logged in the team activities audit trail. </p> </li><li><p>Each audit entry clearly identifies the action type (include or exclude). </p> </li> </ul><h3>Attribution </h3><ul><li><p>Each audit trail entry includes: </p><ul><li><p>The dashboard user who performed the action </p> </li><li><p>The date and time of the action </p> </li><li><p>The affected customer(s) identifier(s) </p> </li><li><p>The program or context where the action occurred </p> </li> </ul> </li> </ul><h3>Visibility &amp; Access </h3><ul><li><p>Audit entries are visible to authorized dashboard members according to existing permissions. </p> </li><li><p>Audit entries are displayed consistently with other team activity records. </p> </li> </ul><br> </div>"
          ]
        }
      ]
    },
    {
      "title": "Add Campaign Channel Filter to Communication Campaigns",
      "overview": "<h2>User Story </h2><p><strong>As a</strong> client (merchant/business owner)<br><strong>I want</strong> to filter communication campaigns by campaign channel (Web, Email, Push Notification, SMS, WhatsApp)<br><strong>So that</strong> I can quickly view and manage only the campaigns for a specific channel without scrolling through all campaign channels </p><hr><h2>Description </h2><p>Currently, the communication campaigns list in the dashboard displays all campaigns regardless of their channel. Clients who run campaigns across multiple channels (Web, Email, Push Notification, SMS, WhatsApp) must manually scan through the entire list to find campaigns for a specific channel. This becomes increasingly difficult as the number of campaigns grows. </p><p>This feature introduces a campaign type filter within the communication campaigns section of the dashboard. Clients will be able to select one or more campaign types to narrow down the campaign list view, making it faster and easier to locate, review, and manage campaigns for a specific channel. </p><p>Impacted areas include the Dashboard UI (Communication Campaigns list/table), the campaign listing API endpoint (filter parameter support), and potentially the campaign data model if a type field is not already indexed. </p><br>",
      "whatsNew": [
        {
          "title": "What's New",
          "description": "",
          "items": [
            "<h2 style=\"box-sizing:border-box;font-weight:600;\">Acceptance Criteria </h2><h3 style=\"box-sizing:border-box;font-weight:600;\">Functional Requirements </h3><ul style=\"box-sizing:border-box;padding:0px 0px 0px 40px;\"><li style=\"box-sizing:border-box;\">Clients can select a single campaign type to filter the list </li><li style=\"box-sizing:border-box;\">Clients can select multiple campaign types simultaneously to view campaigns across selected channels </li><li style=\"box-sizing:border-box;\">The filter supports the following campaign types: Web, Email, Push Notification, SMS, WhatsApp </li> </ul><h3 style=\"box-sizing:border-box;font-weight:600;\">Behavior and Logic </h3><ul style=\"box-sizing:border-box;padding:0px 0px 0px 40px;\"><li style=\"box-sizing:border-box;\">When a filter is applied, the campaign list updates immediately to show only campaigns matching the selected type(s) </li><li style=\"box-sizing:border-box;\">The filter persists during the current session (navigating away and back retains the selected filter) </li><li style=\"box-sizing:border-box;\">The campaign count/total updates to reflect the filtered results </li><li style=\"box-sizing:border-box;\">Pagination resets to page 1 when a filter is applied or changed </li><li style=\"box-sizing:border-box;\">The filter works in combination with any existing filters (e.g., status, Audience) or search functionality </li><li style=\"box-sizing:border-box;\">If no campaigns match the selected filter, a clear empty state message is displayed </li> </ul><h3 style=\"box-sizing:border-box;font-weight:600;\">Backward Compatibility </h3><ul style=\"box-sizing:border-box;padding:0px 0px 0px 40px;\"><li style=\"box-sizing:border-box;\">The existing campaign list view remains unchanged when no filter is applied (default All state) </li><li style=\"box-sizing:border-box;\">No changes to how campaigns are created or stored </li> </ul><h3 style=\"box-sizing:border-box;font-weight:600;\">Security and Permissions </h3><ul style=\"box-sizing:border-box;padding:0px 0px 0px 40px;\"><li style=\"box-sizing:border-box;\">The filter is available to all users who have access to the communication campaigns section </li><li style=\"box-sizing:border-box;\">Filter results respect existing permission boundaries, clients can only see their own campaigns </li> </ul><h3 style=\"box-sizing:border-box;font-weight:600;\">Documentation </h3><ul style=\"box-sizing:border-box;padding:0px 0px 0px 40px;\"><li style=\"box-sizing:border-box;\">Update the dashboard user guide with instructions on how to use the campaign type filter </li><li style=\"box-sizing:border-box;\">Update the API documentation to reflect the new filter query parameter </li><li style=\"box-sizing:border-box;\">Include the filter feature in the release notes </li> </ul><h3 style=\"box-sizing:border-box;font-weight:600;\">Plans </h3><ul style=\"box-sizing:border-box;padding:0px 0px 0px 40px;\"><li style=\"box-sizing:border-box;\">Shopify: Starter, Pro, GURU </li><li style=\"box-sizing:border-box;\">Salla: Pro, GURU </li><li style=\"box-sizing:border-box;\">Enterprise </li> </ul><br><br>"
          ]
        }
      ]
    }
  ],
  "bugFixes": [
    "[HSA] Add the rfm and segments to the tags configuration endpoint"
  ]
}