{
  "date": "February 8, 2026",
  "release": "R26.049-0208",
  "dateRange": "January 31, 2026 to February 8, 2026",
  "newFeatures": [
    {
      "title": "Support Coupon Images for Standalone Manual Coupons",
      "platform": "All",
      "plan": "Shopify & Salla: Free / Pro / GURU · Selfserve: Starter / Growth / Enterprise",
      "channel": "All",
      "description": "Upload an image when creating a coupon, enabling the coupon can be visually represented and retrieved with its image through the Coupons API. Currently, standalone manual coupons do not support images. This enhancement will allow clients to attach an image when creating a manual coupon.",
      "capabilities": []
    },
    {
      "title": "Create Merchant API",
      "platform": "All",
      "plan": "Shopify & Salla: Free / Pro / GURU · Selfserve: Starter / Growth / Enterprise",
      "channel": "All",
      "description": "An API that allows me to create a merchant, enabling I can register merchants programmatically using a merchant ID and merchant name. Currently, there is no dedicated API endpoint to create merchants.",
      "capabilities": []
    },
    {
      "title": "Bulk Customer Data Update via CSV Upload",
      "platform": "All",
      "plan": "Shopify & Salla: Free / Pro / GURU · Selfserve: Starter / Growth / Enterprise",
      "channel": "All",
      "description": "Update my customers’ points, levels, or attributes in bulk by uploading CSV files, enabling I can efficiently manage large-scale customer data updates without needing to make individual edits or API calls.",
      "capabilities": []
    }
  ],
  "improvements": [
    {
      "title": "Include Refund Transactions in Order Transaction Logs API",
      "overview": "Refund transactions to be included in the order transaction logs response, enabling I can retrieve the complete history of all financial actions related to an order through a single endpoint. The endpointGET /api/v4.0/integrations/orders/{orderId}/transactions currently returns transaction logs related to an order, including redemption transactions. However, refund transactions associated with the same order are not included. This enhancement will extend the response to include refund transactions, allowing integrators to access a full, chronological view of all financial activities related to an order.",
      "whatsNew": []
    }
  ],
  "bugFixes": []
}